%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% ニュートンオイラー法　ロボット工学の基礎 P89例題5.2  %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

syms g s1 c1 th1dd d dd ddd  th1d m2 m1 lg2 lg1 l1 l2 I1 I2

f33 = [0;0;0]; % 外力無し
n33 = [0;0;0]; % 外力トルク無し
I11 = [0 0 0;0 0 0;0 0 I1]; % 計算に関係のない部分は0としている
I22 = [0 0 0;0 I2 0;0 0 0]; % 計算に関係のない部分は0としている
s11 = [0;-lg1;0]; % Σ1の原点から重心までの距離
s22 = [0;0;-lg2]; % Σ2の原点から重心までの距離
p01 = [0;0;0]; % Σ0の原点からΣ1の原点までの距離
p12 = [0;-d;0]; % Σ1の原点からΣ2の原点までの距離
R12 = [1 0 0;0 0 -1;0 1 0]; % Σ1からΣ2の回転行列
R21 = [1 0 0;0 0 1;0 -1 0];　%R12の転置（逆行列）

ohm11 = [0;0;th1d];
ohm11d = [0;0;th1dd]; 
v11d = [g*s1;g*c1;0];

ohm22 = [0;th1d;0];
ohm22d = [0;th1dd;0];
v22d = R21*(v11d+cross(ohm11d,p12)+cross(ohm11,cross(ohm11,p12)))+([0;0;ddd]+2*(cross(R21*ohm11,[0;0;dd])));

f22 = m2*v22d+cross(ohm22d,m2*s22)+cross(ohm22,cross(ohm22,m2*s22));
n22 = I22*ohm22d+cross(ohm22,I22*ohm22)+m2*cross(s22,v22d);

p22 = R21*p12;
n11 = I11*ohm11d+cross(ohm11,I11*ohm11)+cross(m1*s11,v11d)+R12*(cross(p22,f22)+n22);
t1 = [0 0 1]*n11 % 回転
t2 = [0 0 1]*f22 % 直動
